---
title: FamilyFailures
classe: Autodesk.Revit.DB.BuiltInFailures+FamilyFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 112
---

# FamilyFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotAddParameterToFamily { get; }` | `FamilyFailures.CannotAddParameterToFamily` | FailureDefinitionId |
| `FailureDefinitionId CannotApplySplitWithGap { get; }` | `FamilyFailures.CannotApplySplitWithGap` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeCategory { get; }` | `FamilyFailures.CannotChangeCategory` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeInstFam { get; }` | `FamilyFailures.CannotChangeInstFam` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeTypeLineBased { get; }` | `FamilyFailures.CannotChangeTypeLineBased` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertInstHostToWorkPlane { get; }` | `FamilyFailures.CannotConvertInstHostToWorkPlane` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertInstWorkPlaneToHost { get; }` | `FamilyFailures.CannotConvertInstWorkPlaneToHost` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyByPatternFamilies { get; }` | `FamilyFailures.CannotCopyByPatternFamilies` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyInplaceFamily { get; }` | `FamilyFailures.CannotCopyInplaceFamily` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyWatchCurveBasedFixture { get; }` | `FamilyFailures.CannotCopyWatchCurveBasedFixture` | FailureDefinitionId |
| `FailureDefinitionId CannotCutRefPlane { get; }` | `FamilyFailures.CannotCutRefPlane` | FailureDefinitionId |
| `FailureDefinitionId CannotFindHost { get; }` | `FamilyFailures.CannotFindHost` | FailureDefinitionId |
| `FailureDefinitionId CannotLoadImperialFamilyToMetricProject { get; }` | `FamilyFailures.CannotLoadImperialFamilyToMetricProject` | FailureDefinitionId |
| `FailureDefinitionId CannotLoadMetricFamilyToImperialProject { get; }` | `FamilyFailures.CannotLoadMetricFamilyToImperialProject` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeType { get; }` | `FamilyFailures.CannotMakeType` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeTypeCB { get; }` | `FamilyFailures.CannotMakeTypeCB` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeTypeFamilySaved { get; }` | `FamilyFailures.CannotMakeTypeFamilySaved` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteLabelsAcrossFamilies { get; }` | `FamilyFailures.CannotPasteLabelsAcrossFamilies` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteObject { get; }` | `FamilyFailures.CannotPasteObject` | FailureDefinitionId |
| `FailureDefinitionId CannotRegenerateCorruptFamily { get; }` | `FamilyFailures.CannotRegenerateCorruptFamily` | FailureDefinitionId |
| `FailureDefinitionId CannotRotateElement { get; }` | `FamilyFailures.CannotRotateElement` | FailureDefinitionId |
| `FailureDefinitionId CannotSetFamilyTypeToNone { get; }` | `FamilyFailures.CannotSetFamilyTypeToNone` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitElement { get; }` | `FamilyFailures.CannotSplitElement` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitWhileBackgroundTasksAreInProgress { get; }` | `FamilyFailures.CannotSplitWhileBackgroundTasksAreInProgress` | FailureDefinitionId |
| `FailureDefinitionId CannotUnlockFamilyTemplate { get; }` | `FamilyFailures.CannotUnlockFamilyTemplate` | FailureDefinitionId |
| `FailureDefinitionId CantCopySelectionToNonStory { get; }` | `FamilyFailures.CantCopySelectionToNonStory` | FailureDefinitionId |
| `FailureDefinitionId CantEditWhileGrouped { get; }` | `FamilyFailures.CantEditWhileGrouped` | FailureDefinitionId |
| `FailureDefinitionId CantMirrorInstWoHost { get; }` | `FamilyFailures.CantMirrorInstWoHost` | FailureDefinitionId |
| `FailureDefinitionId CantMoveFrozenInstance { get; }` | `FamilyFailures.CantMoveFrozenInstance` | FailureDefinitionId |
| `FailureDefinitionId CantPasteSelection { get; }` | `FamilyFailures.CantPasteSelection` | FailureDefinitionId |
| `FailureDefinitionId CantPlaceATOnDuctError { get; }` | `FamilyFailures.CantPlaceATOnDuctError` | FailureDefinitionId |
| `FailureDefinitionId CantPlaceInsertsError { get; }` | `FamilyFailures.CantPlaceInsertsError` | FailureDefinitionId |
| `FailureDefinitionId CantPlaceInsertsWarning { get; }` | `FamilyFailures.CantPlaceInsertsWarning` | FailureDefinitionId |
| `FailureDefinitionId CantPlaceInstanceError { get; }` | `FamilyFailures.CantPlaceInstanceError` | FailureDefinitionId |
| `FailureDefinitionId CantPlaceInstanceWarning { get; }` | `FamilyFailures.CantPlaceInstanceWarning` | FailureDefinitionId |
| `FailureDefinitionId CantSetSlantedColumnEndPlane { get; }` | `FamilyFailures.CantSetSlantedColumnEndPlane` | FailureDefinitionId |
| `FailureDefinitionId CantSolve { get; }` | `FamilyFailures.CantSolve` | FailureDefinitionId |
| `FailureDefinitionId CircularRefsForInstParams { get; }` | `FamilyFailures.CircularRefsForInstParams` | FailureDefinitionId |
| `FailureDefinitionId ColumnAlreadyAttachedWillBeReattached { get; }` | `FamilyFailures.ColumnAlreadyAttachedWillBeReattached` | FailureDefinitionId |
| `FailureDefinitionId ColumnAndTargetAlreadyJoined { get; }` | `FamilyFailures.ColumnAndTargetAlreadyJoined` | FailureDefinitionId |
| `FailureDefinitionId ColumnHeightZeroBecauseOfInvalidOffset { get; }` | `FamilyFailures.ColumnHeightZeroBecauseOfInvalidOffset` | FailureDefinitionId |
| `FailureDefinitionId ColumnTooLong { get; }` | `FamilyFailures.ColumnTooLong` | FailureDefinitionId |
| `FailureDefinitionId ContainsSharedSameNameFamily { get; }` | `FamilyFailures.ContainsSharedSameNameFamily` | FailureDefinitionId |
| `FailureDefinitionId CouldNotGenerateReferencesForFamilyInstance { get; }` | `FamilyFailures.CouldNotGenerateReferencesForFamilyInstance` | FailureDefinitionId |
| `FailureDefinitionId CouldNotPlaceAdaptiveFamInst { get; }` | `FamilyFailures.CouldNotPlaceAdaptiveFamInst` | FailureDefinitionId |
| `FailureDefinitionId CustomFittingCreated { get; }` | `FamilyFailures.CustomFittingCreated` | FailureDefinitionId |
| `FailureDefinitionId DeletingBadFamElemCorruption { get; }` | `FamilyFailures.DeletingBadFamElemCorruption` | FailureDefinitionId |
| `FailureDefinitionId DeletingBadFamElemError { get; }` | `FamilyFailures.DeletingBadFamElemError` | FailureDefinitionId |
| `FailureDefinitionId DeletingBadFamType { get; }` | `FamilyFailures.DeletingBadFamType` | FailureDefinitionId |
| `FailureDefinitionId DeletingBadFamTypeDumped { get; }` | `FamilyFailures.DeletingBadFamTypeDumped` | FailureDefinitionId |
| `FailureDefinitionId DummyHostMustBePerpendicularToXY { get; }` | `FamilyFailures.DummyHostMustBePerpendicularToXY` | FailureDefinitionId |
| `FailureDefinitionId DuplicateFamilyParameterNameWithSharedParameter { get; }` | `FamilyFailures.DuplicateFamilyParameterNameWithSharedParameter` | FailureDefinitionId |
| `FailureDefinitionId DuplicateParamName { get; }` | `FamilyFailures.DuplicateParamName` | FailureDefinitionId |
| `FailureDefinitionId DuplicateTypeName { get; }` | `FamilyFailures.DuplicateTypeName` | FailureDefinitionId |
| `FailureDefinitionId ElementTypeParameterized { get; }` | `FamilyFailures.ElementTypeParameterized` | FailureDefinitionId |
| `FailureDefinitionId FailedToBecomeNonParametric { get; }` | `FamilyFailures.FailedToBecomeNonParametric` | FailureDefinitionId |
| `FailureDefinitionId FailedToSetParameters { get; }` | `FamilyFailures.FailedToSetParameters` | FailureDefinitionId |
| `FailureDefinitionId FailedWhenLoadingFamily { get; }` | `FamilyFailures.FailedWhenLoadingFamily` | FailureDefinitionId |
| `FailureDefinitionId FamilyBadUnattachedVoids { get; }` | `FamilyFailures.FamilyBadUnattachedVoids` | FailureDefinitionId |
| `FailureDefinitionId FamilyCannotBeUpgraded { get; }` | `FamilyFailures.FamilyCannotBeUpgraded` | FailureDefinitionId |
| `FailureDefinitionId FamilyConnectorDeletedError { get; }` | `FamilyFailures.FamilyConnectorDeletedError` | FailureDefinitionId |
| `FailureDefinitionId FamilyConnectorDeletedWarning { get; }` | `FamilyFailures.FamilyConnectorDeletedWarning` | FailureDefinitionId |
| `FailureDefinitionId FamilyDoesntMatchSystemPropertiesDisconnected { get; }` | `FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected` | FailureDefinitionId |
| `FailureDefinitionId FamilyIsCorruptError { get; }` | `FamilyFailures.FamilyIsCorruptError` | FailureDefinitionId |
| `FailureDefinitionId FamilyIsCorruptWarning { get; }` | `FamilyFailures.FamilyIsCorruptWarning` | FailureDefinitionId |
| `FailureDefinitionId FamilyMembersReferToOutsideFamily { get; }` | `FamilyFailures.FamilyMembersReferToOutsideFamily` | FailureDefinitionId |
| `FailureDefinitionId FamilyNoExternalParametersError { get; }` | `FamilyFailures.FamilyNoExternalParametersError` | FailureDefinitionId |
| `FailureDefinitionId FamilyNoExternalParametersWarning { get; }` | `FamilyFailures.FamilyNoExternalParametersWarning` | FailureDefinitionId |
| `FailureDefinitionId FamilyNotFitHostShape { get; }` | `FamilyFailures.FamilyNotFitHostShape` | FailureDefinitionId |
| `FailureDefinitionId FamilyOverconstraint { get; }` | `FamilyFailures.FamilyOverconstraint` | FailureDefinitionId |
| `FailureDefinitionId FamilyOverconstraintCB { get; }` | `FamilyFailures.FamilyOverconstraintCB` | FailureDefinitionId |
| `FailureDefinitionId FamilyParameterNoExist { get; }` | `FamilyFailures.FamilyParameterNoExist` | FailureDefinitionId |
| `FailureDefinitionId FamilyValidationResult { get; }` | `FamilyFailures.FamilyValidationResult` | FailureDefinitionId |
| `FailureDefinitionId FormulaBasedParameterCannotBeChanged { get; }` | `FamilyFailures.FormulaBasedParameterCannotBeChanged` | FailureDefinitionId |
| `FailureDefinitionId FormulasFailedForType { get; }` | `FamilyFailures.FormulasFailedForType` | FailureDefinitionId |
| `FailureDefinitionId FrozenBecauseFaceGone { get; }` | `FamilyFailures.FrozenBecauseFaceGone` | FailureDefinitionId |
| `FailureDefinitionId FrozenBecauseMonitorRelationshipGone { get; }` | `FamilyFailures.FrozenBecauseMonitorRelationshipGone` | FailureDefinitionId |
| `FailureDefinitionId HighlightedElementFamRefsInvalidError { get; }` | `FamilyFailures.HighlightedElementFamRefsInvalidError` | FailureDefinitionId |
| `FailureDefinitionId HighlightedElementFamRefsInvalidWarning { get; }` | `FamilyFailures.HighlightedElementFamRefsInvalidWarning` | FailureDefinitionId |
| `FailureDefinitionId InstMayCutMoreOrFewerHosts { get; }` | `FamilyFailures.InstMayCutMoreOrFewerHosts` | FailureDefinitionId |
| `FailureDefinitionId InstOutsideFaceBoundary { get; }` | `FamilyFailures.InstOutsideFaceBoundary` | FailureDefinitionId |
| `FailureDefinitionId InvalidContextForAdaptivePlacement { get; }` | `FamilyFailures.InvalidContextForAdaptivePlacement` | FailureDefinitionId |
| `FailureDefinitionId InvalidFamilyType { get; }` | `FamilyFailures.InvalidFamilyType` | FailureDefinitionId |
| `FailureDefinitionId InvalidFormularFoundInParameter { get; }` | `FamilyFailures.InvalidFormularFoundInParameter` | FailureDefinitionId |
| `FailureDefinitionId InvalidInsertOrientation { get; }` | `FamilyFailures.InvalidInsertOrientation` | FailureDefinitionId |
| `FailureDefinitionId InvalidParameterValue { get; }` | `FamilyFailures.InvalidParameterValue` | FailureDefinitionId |
| `FailureDefinitionId InvalidSlantedColumnOffsets { get; }` | `FamilyFailures.InvalidSlantedColumnOffsets` | FailureDefinitionId |
| `FailureDefinitionId InvalidSlantedColumnOffsetsInNestedFamily { get; }` | `FamilyFailures.InvalidSlantedColumnOffsetsInNestedFamily` | FailureDefinitionId |
| `FailureDefinitionId MightntPlaceInsertsWarning { get; }` | `FamilyFailures.MightntPlaceInsertsWarning` | FailureDefinitionId |
| `FailureDefinitionId NoInstparamFormulas { get; }` | `FamilyFailures.NoInstparamFormulas` | FailureDefinitionId |
| `FailureDefinitionId NonGenericAnnotationsOutsideLegend { get; }` | `FamilyFailures.NonGenericAnnotationsOutsideLegend` | FailureDefinitionId |
| `FailureDefinitionId NotFamilyFile { get; }` | `FamilyFailures.NotFamilyFile` | FailureDefinitionId |
| `FailureDefinitionId ProfileContainsNoLoops { get; }` | `FamilyFailures.ProfileContainsNoLoops` | FailureDefinitionId |
| `FailureDefinitionId ReferencePlanesOverconstrained { get; }` | `FamilyFailures.ReferencePlanesOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId SetbackTooLarge { get; }` | `FamilyFailures.SetbackTooLarge` | FailureDefinitionId |
| `FailureDefinitionId SharedParameterReplacedByBuiltInOne { get; }` | `FamilyFailures.SharedParameterReplacedByBuiltInOne` | FailureDefinitionId |
| `FailureDefinitionId SizeLookupTableIsNotAvailableForType { get; }` | `FamilyFailures.SizeLookupTableIsNotAvailableForType` | FailureDefinitionId |
| `FailureDefinitionId SketchCannotBeAutomaticallyDimensioned { get; }` | `FamilyFailures.SketchCannotBeAutomaticallyDimensioned` | FailureDefinitionId |
| `FailureDefinitionId SlantedColumnEndCutPlaneIsParallelToGeometry { get; }` | `FamilyFailures.SlantedColumnEndCutPlaneIsParallelToGeometry` | FailureDefinitionId |
| `FailureDefinitionId SlantedColumnEndPlanesHaveFlipped { get; }` | `FamilyFailures.SlantedColumnEndPlanesHaveFlipped` | FailureDefinitionId |
| `FailureDefinitionId StructuralColumnAttachedToNonStructuralTarget { get; }` | `FamilyFailures.StructuralColumnAttachedToNonStructuralTarget` | FailureDefinitionId |
| `FailureDefinitionId TitleblockBadViewType { get; }` | `FamilyFailures.TitleblockBadViewType` | FailureDefinitionId |
| `FailureDefinitionId TryingToAttachWhenJoined { get; }` | `FamilyFailures.TryingToAttachWhenJoined` | FailureDefinitionId |
| `FailureDefinitionId TypeRecursiveElementIdParameter { get; }` | `FamilyFailures.TypeRecursiveElementIdParameter` | FailureDefinitionId |
| `FailureDefinitionId UnableGenerateTrussByFamilyAndOrientation { get; }` | `FamilyFailures.UnableGenerateTrussByFamilyAndOrientation` | FailureDefinitionId |
| `FailureDefinitionId UnableToUpgradeDueToCorruptFamilies { get; }` | `FamilyFailures.UnableToUpgradeDueToCorruptFamilies` | FailureDefinitionId |
| `FailureDefinitionId UnexpectedFamilyChangeResultsError { get; }` | `FamilyFailures.UnexpectedFamilyChangeResultsError` | FailureDefinitionId |
| `FailureDefinitionId UnexpectedFamilyChangeResultsWarning { get; }` | `FamilyFailures.UnexpectedFamilyChangeResultsWarning` | FailureDefinitionId |
| `FailureDefinitionId ValueOutOfRange { get; }` | `FamilyFailures.ValueOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId WhileLoadingFamily { get; }` | `FamilyFailures.WhileLoadingFamily` | FailureDefinitionId |
| `FailureDefinitionId WhileLoadingFamilyShared { get; }` | `FamilyFailures.WhileLoadingFamilyShared` | FailureDefinitionId |
| `FailureDefinitionId WhileScanningParametersForType { get; }` | `FamilyFailures.WhileScanningParametersForType` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```